#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token: Reading...
random_password.rtmp_password: Refreshing state... [id=none]
random_password.alicloud3_password: Refreshing state... [id=none]
tls_private_key.alicloud3_key: Refreshing state... [id=f63af23191753064cf32785a897bf9b0e4143c8a]
random_password.alicloud_password: Refreshing state... [id=none]
random_password.okd_password: Refreshing state... [id=none]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
data.onepassword_item.rabbit_01_psp_token: Reading...
random_password.webserver_password: Refreshing state... [id=none]
tls_private_key.okd_key: Refreshing state... [id=7a838e5cdfd2acbdebde6319f9c31b7840c4e633]
tls_private_key.alicloud_key: Refreshing state... [id=2715b21a5b35894000d79cf7965b18307e9258b3]
data.onepassword_item.ssh_key_new: Reading...
onepassword_item.lxc_access: Refreshing state... [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/ldva6u4clsjb7ueiydldnpsrc4]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
data.onepassword_item.ssh_key: Reading...
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
local_file.alicloud3_key_file: Refreshing state... [id=9cb4b53c3420c0fc6eb951fe0ec7cbe716a41334]
local_file.alicloud_key_file: Refreshing state... [id=e71958442d331fe590a11c211113b6bc0c601a0f]
local_file.okd_key_file: Refreshing state... [id=4c59c14cb91e647089a9a38ad685bbb01387f544]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
data.onepassword_item.ssh_key_new: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/duivcbljdj4nufcxr6wgwcnsrq]
data.onepassword_item.ssh_key: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/fg6utxhi7yzuxmheo3a4dpqcaq]
data.external.rabbit_01_psp_token: Read complete after 0s [id=-]
proxmox_virtual_environment_download_file.latest_ubuntu_22_04_jammy_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-22.04-standard_22.04-1_amd64.tar.zst]
proxmox_virtual_environment_file.cloud_config_okd: Refreshing state... [id=local:snippets/fedoracoreos.cloud-config.yaml]
proxmox_virtual_environment_download_file.latest_ubuntu_24_04_noble_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst]
proxmox_virtual_environment_file.cloud_config_alicloud3: Refreshing state... [id=local:snippets/alicloud3.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.fedora_coreos_cloud_image: Refreshing state... [id=local:iso/fedora-coreos-38.img]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.cloud_config_alicloud: Refreshing state... [id=local:snippets/alicloud.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]
proxmox_virtual_environment_container.haproxy_container[0]: Refreshing state... [id=800]
proxmox_virtual_environment_container.satisfactory_container: Refreshing state... [id=805]
proxmox_virtual_environment_container.satisfactory_shared_container: Refreshing state... [id=806]
proxmox_virtual_environment_container.proxy_container: Refreshing state... [id=801]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.alicloud3_key_file will be created
  + resource "local_file" "alicloud3_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud3-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.alicloud_key_file will be created
  + resource "local_file" "alicloud_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.okd_key_file will be created
  + resource "local_file" "okd_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./okd-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                                   = "601"
        name                                 = "rtmp1.ddlns.net"
      ~ scsi_hardware                        = "virtio-scsi-single" -> "virtio-scsi-pci"
        tags                                 = [
            "automation",
            "rtmp1",
            "ubuntu",
        ]
        # (33 unchanged attributes hidden)

      ~ cpu {
          + architecture = "x86_64"
            # (9 unchanged attributes hidden)
        }

      ~ initialization {
          ~ datastore_id         = "local" -> "data-ssd"
            # (7 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                                   = "501"
        name                                 = "web1.ddlns.net"
      ~ scsi_hardware                        = "virtio-scsi-single" -> "virtio-scsi-pci"
        tags                                 = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (33 unchanged attributes hidden)

      ~ cpu {
          + architecture = "x86_64"
            # (9 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Warning: Attribute Deprecated

  with provider["registry.terraform.io/1password/onepassword"],
  on provider.tf line 47, in provider "onepassword":
  47:   url   = var.onepassword_endpoint

The "url" field is deprecated and will be removed in a future version. Use
"connect_url" instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*